<template>
  <div class="container" v-if="book">
    <div class="book-image">
      <img :src="book.picture" :alt="book.name">
    </div>
    <div class="book-details">
      <h1>{{ book.name }}</h1>
      <div class="author-info-container">
        <p class="author-info">作者: {{ book.author }}</p>
      </div>

      <h2 class="book-intro-title">书籍简介:</h2>
  <p class="book-intro-content">{{ book.details }}</p>
</div>
  </div>
</template>

<script>
export default {
  name: 'BookDetails',
  data() {
    return {
      book: null,
      // 假设这里是从外部获取的书籍详情数组
      booksDetails: [
        // ...书籍详情  
        {
  id: 1,
  name: '《Vue.js 3.0项目开发实战》',
  author: '[中] 张帆',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/157681/23/28339/57178/6494327bFddea0f6e/257c2861d919c896.jpg',
  details: '本书以JavaScript语言为基础，以Vue.js项目开发过程为主线，介绍了一整套面向Vue.js的项目开发技术。从NoSQL数据库的搭建到Express项目API的编写，最后再由Vue.js显示在前端页面中，让读者可以非常迅速地掌握一门技术，提高项目开发的能力。本书分为4篇。第1篇介绍了Vue.js基础环境的搭建，是全书的基石；第2篇介绍了电影网站项目的设计，涵盖ES 6、Webpack、工程化环境搭建等关键技术；第3篇介绍了电影网站项目前端和后端的实现，涵盖Node.js后端技术、Vue.js各种组件和API等技术；第4篇介绍了页面优化，通过讲解一些Vue.js模板和框架的用法，带领读者制作更加美观的UI界面。本书适合Vue.js初学者和进阶者阅读，也适合其他Web前端和后端开发爱好者阅读；对于一些IT领域的产品经理而言，本书也有较高的参考价值；对于一些培训机构和各类开设Web开发课程的学校来说，本书是一本很好的项目开发教程.'
},
{
  id: 2,
  name: '《深入浅出Vue.js》',
  author: '[中] 刘博文',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/140181/21/40207/40320/650a861bF5f5b86fe/2e54479d2efb214f.jpg',
  details: '本书从源码层面分析了Vue.js。首先，简要介绍了Vue.js；然后详细讲解了其内部核心技术“变化侦测”，这里带领大家从0到1实现一个简单的“变化侦测”系统；接着详细介绍了虚拟DOM技术，其中包括虚拟DOM的原理及其patching算法；紧接着详细讨论了模板编译技术，其中包括模板解析器的实现原理、优化器的原理以及代码生成器的原理；最后详细介绍了其整体架构以及提供给我们使用的各种API的内部原理，同时还介绍了生命周期、错误处理、指令系统与模板过滤器等功能的原理。本书适合前端开发人员阅读。'
},
{
  id: 3,
  name: '《Vue.js从入门到精通》',
  author: '[中] 明日科技',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/216898/39/33738/87144/64a24165F6b3d3f3e/2d767a16229160a1.jpg',
  details: '《Vue.js从入门到精通》从初学者角度出发，通过通俗易懂的语言、丰富多彩的实例，详细介绍了使用Vue.js进行程序开发需要掌握的各方面技术。全书分为4篇，共19章，内容包括初识Vue.js、ECMAScript 6语法介绍、Vue实例与数据绑定、条件判断指令、v-for指令、计算属性和监听属性、元素样式绑定、事件处理、表单元素绑定、自定义指令、组件、组合API、过渡和动画效果、渲染函数、使用Vue Router实现路由、使用axios实现Ajax请求、Vue CLI、状态管理，以及51购商城项目实战。书中的大多数知识点都结合具体实例进行介绍，涉及的程序代码给出了详细的注释，使读者可轻松领会Vue.js程序开发的精髓，快速提高开发技能。'
},
{
  id: 4,
  name: '《深入实战Vue开发》',
  author: '[中] 殷荣桧',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/201355/28/6293/63576/613af58fE2a597cfa/46206f512c6b3792.jpg',
  details: '本书以Vue 3版本为基础，通过大量的实战案例深入分析了Vue 接口（API）的特性、原理与应用场景，着重介绍了每个API的使用频率、细节、注意点和在项目中的应用，书中给出了编者在大厂工作中总结的大量Vue开发中的项目经验与案例，有助于读者深入理解Vue的原理并提升项目经验。通过阅读本书，读者能够在没有接触大型项目的情况下也可以了解Vue在大型项目中的使用。本书适合有一定Vue基础想深入提升技能的开发人员以及对Vue 3技术感兴趣的各类开发人员使用。'
},
{
  id: 5,
  name: '《HTML5动画制作神器》',
  author: '[中] 张晓景',
  picture: 'https://img14.360buyimg.com/n0/jfs/t5041/36/1486995755/592920/c3e9b20a/58f0f808N15c3421d.jpg',
  details: '《HTML5动画制作神器：Adobe Edge Animate CC一本通》详细地介绍了Edge Animate CC中的所有知识点，以通俗易懂的文字、精美的案例和新颖的版式讲解各种类型交互动画的制作方法和技巧，将Edge Animate CC的知识点与实际应用案例相结合，使读者易学易用、快速掌握使用Edge Animate CC制作交互动画的相关知识。'
},
{
  id: 6,
  name: '《沉思录》',
  author: '[古罗马] 玛克斯·奥勒留',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/50822/20/375/124157/5cd4f3c5E18d0cd81/2fd5f60604909f5d.jpg',
  details: '《沉思录》来自于作者对身羁宫廷的自身和自己所处混乱世界的感受，追求一种摆脱了激情和欲望、冷静而达观的生活。马可·奥勒留在书中阐述了灵魂与死亡的关系，解析了个人的德行、个人的解脱以及个人对社会的责任，要求常常自省以达到内心的平静，要摒弃一切无用和琐屑的思想、正直地思考。而且，不仅要思考善、思考光明磊落的事情，还要付诸行动。'
},
{
  id: 7,
  name: '《生命之书》',
  author: '[印度] 克里希那穆提',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/70219/21/8371/422744/5d64c267Ec8744da4/5a8dd9628212d93a.jpg',
  details: '本书是克氏教诲的精选，诸多内容内地读者都不曾接触。对于尚未领略克氏智慧之光的人而言，它是最佳入门读物，深入浅出，完整详实。'
},
{
  id: 8,
  name: '《了凡四训》',
  author: '[中] 袁了凡 ',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/216164/7/34673/55129/64b77b15Fc1e3a21c/dc2dfbf0c8812756.jpg',
  details: '《了凡四训》主要有四个章节构成，分别是立命之学、改过之法、积善之方和谦德之效。 [5]袁了凡以其毕生的学问与修养，融通儒、道、佛三家思想，以自己的亲身经历，并结合大量真实生动的事例，告诚世人不要被“命”字束缚手脚，要自强不息，改造命运。'
},
{
  id: 9,
  name: '《查拉图斯特拉如是说》',
  author: '[德] 尼采 ',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/151832/12/8924/264179/5fd015b6Efbecb05b/23448b4f9fe1194a.jpg',
  details: '《查拉图斯特拉如是说》共分为四部，每一部又由相对独立的散文诗组成。第一部讲述了查拉图斯特拉从隐居到开始说教的精神演变历程。查拉图斯特拉在30岁的时候离开家乡和众人，独自在山上隐居，临近“不惑之年”之时自觉精神充盈饱满，于是下山在群众中宣讲自己的主张。他的说教虽然不被理解和欢迎，但也赢得了一些弟子。在第一部分临近结束之时，查拉图斯特拉跟弟子告别，重返孤独，让大家各寻出路。在第二部中，重返孤独的查拉图斯特拉梦见自己的说教被世人歪曲，于是他再次下山拯救弟子。他前往“幸福岛”，对“同情者”、“传教士”、“有道德的人”、“学者”、“诗人”、“预言家”等各类“现代人”进行了尖锐的批判。末尾时他感觉到有一种思想在他心中渐渐升起，这个思想就是全书的核心“永远回归”，但又自感时候未到，于是挥泪离开“幸福岛”，再次返诸孤独。第三部从查拉图斯特拉登船返程开始写起，他一路对基督教传统、对旧的道德和现代社会进行猛烈批判。他感到关于“永远回归”的思想正在成熟。第四部是全书的终曲。这一部有多种人物粉墨登场，他们是查拉图斯特拉所说的“高人”：“预言者”、“统治者”、“有良心的学究”、“精神魔术师”、“最后的教皇”、“极丑的人”、“自愿的乞丐”和“影子”。查拉图斯特拉一度受到诱惑对这些“高人”的努力表示同情，但最终他超越了同情，因为同情是弱者的道德。在全书结束之际，查拉图斯特拉终于明白，自己追求的不是幸福，而是“事业”，于是他再次离开隐居的山洞，“就像从阴暗的山后升起的晨曦，热烈而强壮”。'
},
{
  id: 10,
  name: '《社会心理学》',
  author: '[美] 戴维·迈尔斯',
  picture: 'https://img14.360buyimg.com/n0/jfs/t6037/142/729241766/490719/78a3a9bf/592bf16dN50326aad.jpg',
  details: '《社会心理学》这本书被美国700多所大学或学院的心理系所采用，是这一领域的主导教材，已经成为评价其他教材的标准。这本书将基础研究与实践应用完美地结合在一起，以富有逻辑性的组织结构引领学生了解人们是如何思索、影响他人并与他人建立联系的。是人们了解自身、了解社会、了解自己与社会之间关系的最佳的指导性书籍。'
},
{
  id: 11,
  name: '《月亮与六便士》',
  author: '[英] 毛姆 ',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/99340/19/32929/81871/63085eb8Eaf902506/d4dcc15dd42a2f8b.jpg',
  details: '思特里克兰德是个在伦敦做事的证券经纪人，他有一个富裕和美满的家庭：妻子漂亮，爱慕虚荣，两个孩子健康快乐。按理说，他应该满足于这种人世的快乐才对，尽管这种生活未免庸俗和平静。但是，就在他们婚后的第17个年头，他突然离家去了巴黎，抛弃了在外人看来很好的事业和家庭。就在人们以为他的出走是因为有外遇的时候，人们发现的事实却是：他原来只是为了画画。这时的思特里克兰德没有任何的绘画基础，他只是爱好画画而已。在外人看来，他简直疯了，他的生活开始变得窘迫，几次险些因饥饿和疾病而死。他画的画也完全不像个样子，总是在原有的事物上进行破坏，除了有个蹩脚的画家戴尔克·施特略夫把他当成上帝外，任何人都不会买他的画，事实上他也从不轻易卖画。他不停地流浪，最后来到了塔西提岛，与一个土著姑娘爱塔结了婚。这时的他看起来似乎很知足，他有了一个土著人做妻子，他们生活在与世隔绝的地方，他每天都在那里作画。但不幸的是，不久他就感染了麻风病，在他病逝的前一年，他成了瞎子。爱塔一直照顾着他，直到他完成了自己的巨型壁画，身体溃烂而死。他的妻子依照他的遗言焚毁了挂满壁画的屋子，甚至没有留下一根木头。'
},
{
  id: 12,
  name: '《杀死一只知更鸟》',
  author: '[美] 哈珀·李',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/214904/28/21761/88048/634516d2E96f1eb25/93d894a1152b229e.jpg',
  details: '20世纪30年代，大萧条时期美国南部的一个小镇。孤儿男孩迪儿来到梅康镇找他的姨姨过暑假，杰姆和斯库特与他成为朋友。三个孩子被他们的隐居邻居所深深吸引，那个邻居叫做阿瑟·拉德利，令人生畏。梅科姆镇的人们不愿谈及拉德利，在许多年后也没有人见过他。孩子们则利用谣言编造了各种故事，推测背后隐藏的玄机，并设计一个计划引他出门。在之后的两个暑假中，三个孩子发现，有人在拉德利家外的树上常给他们留小礼物，有时，这个神秘的布向孩子们示好，但令人遗憾的是，布从来没有亲自出现过。阿蒂克斯被法院指定为汤姆·鲁滨逊辩护，后者是一位黑人，他被控强奸一位白人少女马耶拉·尤厄尔。虽然许多梅科姆镇人表示反对，但阿蒂克斯同意为汤姆辩护，有的孩子因阿蒂克斯而嘲笑杰姆和斯库特，称他们的父亲是“爱黑鬼的家伙”。斯库特甚至被挑衅为她父亲的荣誉而打架，而父亲告诉他别这么做。而阿蒂克斯面对一群想要将汤姆处以私刑的人，由于斯库特、杰姆和迪儿的突然出现，使得暴徒们不得不被迫从阿蒂克斯与汤姆的角度来考虑问题，因此倍感羞愧，四散离去，危机得到了化解。因为阿蒂克斯不想让孩子们出席汤姆·鲁滨逊的审判，斯库特、杰姆和迪儿只能从有色人种观礼台上悄悄旁听。阿蒂克斯假设原告马耶拉和她嗜酒的父亲鲍伯·尤厄尔撒谎。并不友好的马耶拉主动向汤姆施加诱惑，而她父亲为此对她大打出手。虽然汤姆的无辜显而易见，但陪审团依然判他有罪。当绝望的汤姆越狱被杀时，杰姆与阿蒂克斯对司法公正的信念受到了极大的打击。虽然鲍伯·尤厄尔胜诉，但他的名声扫地，他气急败坏的誓言报复。鲍伯当街啐了阿蒂克斯的脸，试图闯入审判法官的家骚扰汤姆·鲁滨逊的遗孀。最后，一天晚上，当杰姆和斯库特从学校的万圣节盛会回家的时候，鲍伯突然对他们痛下毒手。杰姆的胳膊在打斗中折断，但在混乱中，一位陌生人救出了孩子们，这位神秘人将杰姆扛回家，斯库特认出他就是阿瑟·拉德利。梅科姆镇的警长来到并发现鲍伯·尤厄尔死于缠斗。警长与阿蒂克斯进行辩论，试图确认杰姆和鲍伯俩人谁该负责。阿蒂克斯最终接受了警长的观点：尤厄尔摔到了自己的刀上。拉德利请斯库特送他回家，在道别之后，他再度消失。站在拉德利的门外，斯库特为他们无法偿还之前的礼物而深表遗憾。'
},
{
  id: 13,
  name: '《从零开始的女性主义》',
  author: '[日] 上野千鹤子',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/213970/21/23197/51818/636e72e5E8da2341e/5ae257850d605449.jpg',
  details:'女性主义是什么？为什么我们需要女性主义？如何用女性主义进行思考？围绕上述种种问题，日本著名学者上野千鹤子与知名漫画家田房永子，开始了一场从零开始的女性主义课堂。她们用幽默的语言、传神的漫画，回溯女性主义的发展历程，畅谈母女关系、性、工作、婚恋、育儿等日常生活中的议题，驳斥关于女性的刻板偏见。这堂课不仅开启了一趟全新的旅程，更告诉我们：女性主义，不仅仅关乎女性，更关乎每个人的日常生活。'
},
{
  id: 14,
  name: '《自由在高处》',
  author: '[中] 熊培云',
  picture: 'https://img14.360buyimg.com/n1/s546x546_jfs/t1/34765/4/21056/170007/63e48a72F19fc93d2/ca4cf677d7ab1751.png',
  details:'改变不了大环境，就改变小环境。小环境改变了，大环境也会随之改变。做自己力所能及的事情。你不能决定太阳几点升起，但能决定自己几点起床。这是我的人生，我必让它自由。每个人都应该是自己人生的领导者。那些能够带领千军万马的人，未必能带领好自己。要么成为自己，要么一无所成。帕特里克说：“不自由，毋宁死！”熊培云说：“不自由，仍可活。”《自由在高处》是作者对《重新发现社会》一书的重要补充。旨在从个体角度探讨身处转型期的人们如何超越逆境，盘活自由，拓展生存，积极生活。自由与自救，是本书的方向与重点。'
},
{
  id: 15,
  name: '《小王子》',
  author: '[法] 安东尼·德·圣埃克苏佩里',
  picture: 'https://img14.360buyimg.com/n0/jfs/t1/179768/1/27938/63110/63e34368F62a2a859/ea97c5fbb820a6fc.jpg',
  details:'小说叙述者是个飞行员，他在故事一开始告诉读者，他在大人世界找不到一个说话投机的人，因为大人都太讲实际了。接着，飞行员讲了六年前他因飞机故障迫降在撒哈拉沙漠遇见小王子的故事。神秘的小王子来自另一个星球。飞行员讲了小王子和他的玫瑰的故事。小王子为什么离开自己的星球；在抵达地球之前，他又访问过哪些星球。他转述了小王子对六个星球的历险，他遇见了国王、爱虚荣的人、酒鬼、商人、点灯人、地理学家、蛇、三枚花瓣的沙漠花、玫瑰园、扳道工、商贩、狐狸以及我们的叙述者飞行员本人。飞行员和小王子在沙漠中共同拥有过一段极为珍贵的友谊。当小王子离开地球时，飞行员非常悲伤。他一直非常怀念他们共度的时光。他为纪念小王子写了这部小说。'
}

      ]
    }
  },
  created() {
    const bookId = parseInt(this.$route.params.id);
    this.book = this.booksDetails.find(book => book.id === bookId);
  }
};
</script>

<style scoped>
body {
  font-family: Arial, sans-serif;
  margin: 0;
  padding: 0;
  box-sizing: border-box;
}

.container {
  display: flex;
  max-width: 800px;
  margin: 20px auto;
  align-items: flex-start; /* 确保子元素从顶部开始对齐 */
}

.book-image img {
  max-width: 100%;
  height: auto;
  transform: scale(1.4); /* 根据需要调整图片大小 */
}


.book-image {
  flex: 1;
  padding: 20px;
  align-items: flex-start; /* 确保图片容器内部的对齐方式 */
  display: flex;
}

.book-details {
  flex: 2;
  padding: 20px;
  box-sizing: border-box;
  display: flex;
  flex-direction: column;
  justify-content: flex-start;
  background-color: rgba(255, 255, 255, 0.5); /* 添加透明度为50%的白色背景 */
  /* 您可以根据需要更改颜色 */
}

img {
  max-width: 100%;
  height: auto;
}

/* 添加规则使得首行缩进两个空格 */
.book-details p {
  text-align: left; /* 左对齐 */
  text-indent: 2em; /* 首行缩进两个字符 */
  white-space: pre-wrap; /* 保留换行符和空白符 */
}

.book-details h1 {
  margin-top: 0; /* 移除标题的上边距 */
  /* 其他样式保持不变 */
}

/* 为作者信息添加加粗样式 */
.author-info-container {
  text-align: center; /* 对包装器应用居中 */
  width: 100%; /* 确保包装器占据所有可用宽度 */
}

.author-info {
  display: inline-block; /* 使元素以内联块的方式显示，这样text-align才能生效 */
  font-weight: bold; /* 字体加粗 */
  font-size: larger; /* 字体放大 */
}


.book-intro-title {
  text-align: left; /* 顶格 */
  font-size: larger; /* 字体放大 */
  margin: 10px 0; /* 添加一些外边距，根据需要调整 */
}

.book-intro-content {
  text-align: left; /* 左对齐 */
  text-indent: 2em; /* 首行缩进两个字符 */
  font-weight: bold; /* 字体加粗 */
  white-space: pre-wrap; /* 保留换行符和空白符 */
  margin-top: 0; /* 去掉段落顶部的外边距 */
}

</style>
